# =============================================================================
# YOLOv8n-P2 Architecture — 4-Head High-Resolution Configuration
# =============================================================================
# This configuration extends the standard YOLOv8n (3-head: P3, P4, P5) with
# an additional P2 detection head for micro-object detection.
#
# P2 HEAD ADVANTAGES:
#   - Stride 4 → 160×160 grid at 640px input, 320×320 grid at 1280px
#   - Extracts features from early backbone layers (minimal downsampling)
#   - Retains fine spatial details critical for objects < 16px
#
# TRADE-OFFS:
#   - Higher memory usage (~2× compared to standard 3-head)
#   - Slower inference (~1.5× compared to standard 3-head)
#   - More parameters to train
#
# ARCHITECTURE OVERVIEW:
#   Backbone → [P2, P3, P4, P5] → Neck (PANet) → 4 Detection Heads
# =============================================================================

# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs

# Parameters
nc: 5  # number of classes (must match dataset.yaml)
scales:
  # [depth_multiple, width_multiple, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n-p2

# YOLOv8n-p2 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0: P1/2  — stride 2
  - [-1, 1, Conv, [128, 3, 2]]       # 1: P2/4  — stride 4 ← P2 FEATURE SOURCE
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3: P3/8  — stride 8
  - [-1, 6, C2f, [256, True]]        # 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5: P4/16 — stride 16
  - [-1, 6, C2f, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7: P5/32 — stride 32
  - [-1, 3, C2f, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9: Spatial Pyramid Pooling

# YOLOv8n-p2 head (PANet with 4 detection heads)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10: Upsample P5 → P4 size
  - [[-1, 6], 1, Concat, [1]]                     # 11: Concat with backbone P4
  - [-1, 3, C2f, [512]]                           # 12: Process P4 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13: Upsample P4 → P3 size
  - [[-1, 4], 1, Concat, [1]]                     # 14: Concat with backbone P3
  - [-1, 3, C2f, [256]]                           # 15: Process P3 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16: Upsample P3 → P2 size
  - [[-1, 2], 1, Concat, [1]]                     # 17: Concat with backbone P2
  - [-1, 3, C2f, [128]]                           # 18: Process P2 features ← NEW P2 HEAD

  - [-1, 1, Conv, [128, 3, 2]]                    # 19: Downsample P2 → P3 size
  - [[-1, 15], 1, Concat, [1]]                    # 20: Concat with P3 features
  - [-1, 3, C2f, [256]]                           # 21: Process P3 (bottom-up)

  - [-1, 1, Conv, [256, 3, 2]]                    # 22: Downsample P3 → P4 size
  - [[-1, 12], 1, Concat, [1]]                    # 23: Concat with P4 features
  - [-1, 3, C2f, [512]]                           # 24: Process P4 (bottom-up)

  - [-1, 1, Conv, [512, 3, 2]]                    # 25: Downsample P4 → P5 size
  - [[-1, 9], 1, Concat, [1]]                     # 26: Concat with P5 features
  - [-1, 3, C2f, [1024]]                          # 27: Process P5 (bottom-up)

  # Detection heads — 4 outputs for P2, P3, P4, P5
  - [[18, 21, 24, 27], 1, Detect, [nc]]           # 28: Detect(P2, P3, P4, P5)
